export const ethicsProblems = [
  {
    pid: 0,
    title: "인공지능과 일자리 감소",
    content:
      "1. 특정 AI의 개발로 대부분의 공무처리가 AI로 대체가 가능해 공무원으로 일하는 사람들이 대부분 일자리를 잃는 것이 자명할 때 개발자는 이 AI를 개발하는 것이 옳은 것일까? (AI로 하는 공무 처리는 사람이 하는 것보다 신속하고 정확성이 더 높다고 가정한다.)",
    optionA: "AI를 개발 시",
    optionB: "AI를 개발하지 않을 시",
  },
  {
    pid: 1,
    title: "개인 정보 보호1",
    content:
      "2. 게임 개발 회사에 다니는 A 씨는 게임 출시 전날 고객의 개인정보를 보호하는 보안 프로그램에 치명적 오류가 생겨 개인정보가 유출되기 쉬움을 발견하였다. 만약 제 날짜에 게임 출시를 하지 않으면 A 씨는 계약 위반으로 막대한 돈을 내야 한다. A 씨는 사람들이 회원가입 시 개인정보 보호 약관을 제대로 읽지 않는다는 것을 알아 보호 약관에 이에 대한 글을 살짝 명시하고 침묵한다면 나중에 피해가 생겨도 문제가 되지 않음을 알고 있다. 이 때 A 씨는 게임 출시를 그대로 진행하는 것이 옳을까?",
    optionA: "게임 출시 진행 시",
    optionB: "게임 출시 진행 하지 않을 시",
  },
  {
    pid: 2,
    title: "데이터 수집 범위",
    content:
      "소프트웨어 회사는 기능을 개선하고 개인화된 권장 사항을 제공하기 위해 사용자 데이터를 수집하는 생산성 응용 프로그램을 개발합니다. 다음과 같은 옵션이 있습니다.",
    optionA:
      "명시적인 동의를 얻거나 데이터 사용에 대한 명확한 정보를 제공하지 않고 사용자 데이터를 수집하고 저장합니다.",
    optionB:
      "투명한 데이터 수집 관행을 구현하고 데이터 사용 및 개인 정보 보호 정책에 대한 명확한 정보와 함께 명시적인 사용자 동의를 얻습니다.",
  },
  {
    pid: 3,
    title: "데이터 수집 범위1",
    content:
      "소셜 미디어 플랫폼은 사용자의 기존 믿음과 관심사에 맞는 콘텐츠의 우선 순위를 지정하고 표시하여 사용자 참여를 최적화하는 알고리즘 구현을 고려하고 있습니다.",
    optionA:
      "기존 믿음과 관심사를 강화하는 콘텐츠를 표시하여 사용자 참여를 극대화하는 알고리즘을 구현합니다.",
    optionB:
      "다양하고 균형 잡힌 콘텐츠를 우선시하는 알고리즘을 구현하여 사용자를 더 넓은 범위의 관점에 노출시킵니다.",
  },
  {
    pid: 4,
    title: "데이터 편향",
    content:
      "천재 개발자 앨리스는 혁신적인 의료 진단 알고리즘을 개발했다. 그러나 알고리즘은 의외로 특정 인종의 환자들에게 오진을 내놓는 것으로 드러난다. 앨리스는 이 문제를 깊이 고민하며 윤리적인 딜레마에 빠진다. 그녀는 의료 데이터에 다양성을 반영하고 편향을 제거하기 위해 노력하기로 결심한다. 하지만 그녀는 이를 위해 시간과 비용이 많이 드는 작업을 해야 한다는 사실을 깨닫는다. 앨리스는 회사의 엄격한 일정과 예산 상황에서 이 문제를 어떻게 해결할 수 있을지 고민하며, 동시에 자신의 개인적인 가치와 도덕적 의무 사이에서 갈등한다",
    optionA: "회사의 일정과 예산 상황에 맞추어 알고리즘을 공개한다",
    optionB: "회사에서 제시한 일정을 맞추지 못하더라도 알고리즘을 개선한다.",
  },
  {
    pid: 5,
    title: "저작권 윤리의식1",
    content:
      "개발자 앨리스는 회사에서 맡은 소프트웨어 개발 프로젝트에 전념하고 있다. 그러나 어느 날, 앨리스는 회사 내부에서 라이센스 없이 사용되는 부정한 라이브러리와 도구를 발견한다. 이를 알게 된 앨리스는 윤리적인 딜레마에 직면하게 된다. 앨리스는 회사의 압박과 경쟁 환경 속에서 라이센스를 무시하고 개발을 진행하는 선택을 할지 말지 고민한다. 한편으로는 프로젝트를 성공적으로 완료하기 위해 부정한 방법을 택할 수 있지만, 그것은 윤리적으로 허용되지 않는 행위일 수 있다.",
    optionA: "부정한 방법으로 개발을 진행한다.",
    optionB: "라이센스를 준수하고 개발을 진행한다.",
  },
  {
    pid: 6,
    title: "데이터 수집 범위2",
    content:
      "개발자 A는 회사에서 맡은 소프트웨어 개발 프로젝트에 전념하고 있다. 그러나 어느 날, A는 로그 파일에 대한 윤리적인 딜레마에 직면하게 된다. A는 로그 파일에 어떤 정보를 저장해야 하는지와 그 정보를 어떻게 처리해야 하는지에 대해 고민하고 있다. 로그 파일에는 사용자의 개인정보, 접속 기록, 애플리케이션의 동작 상세 등 다양한 정보가 저장될 수 있다. 이 정보들은 개발자와 회사에게 중요한 통찰력과 가치를 제공할 수 있지만, 동시에 사용자의 개인정보 보호와 개인정보 처리 규정에 대한 책임도 요구한다.",
    optionA: "모든 정보를 로그 파일에 저장하고 자세히 분석한다.",
    optionB: "필요한 최소한의 정보만 로그 파일에 저장한다.",
  },
  {
    pid: 7,
    title: "소프트웨어 보안1",
    content:
      "소프트웨어 개발자 A는 자사의 제품에 버그를 발견합니다. 이 버그는 일부 사용자에게 잠재적인 문제를 일으킬 수 있지만, 심각한 영향을 주지는 않습니다. A는 이 상황에서 윤리적인 딜레마에 직면하게 됩니다.",
    optionA: "버그를 수정한다.",
    optionB: "버그를 그대로 둔다.",
  },
  {
    pid: 8,
    title: "소프트웨어 보안2",
    content:
      "코딩 개발자로서, 회사에서 고객의 개인정보를 처리하는 애플리케이션을 개발하고 있다. 그러나 회사 내부에서 애플리케이션에 접근할 수 있는 권한이 고도로 제한되어 있어서, 실수로 개인정보를 외부로 유출할 위험은 거의 없다. 그런데 어떤 날, 애플리케이션에 치명적인 보안 취약점을 발견하게 된다. 이 취약점을 이용하면 해커가 접근하여 대량의 개인정보를 유출할 수 있다는 사실을 알게 된다.",
    optionA: "해당 보안 취약점이 발견되었다는 것을 알린다.",
    optionB: "해당 보안 취약점이 발견되었다는 것을 알리지 않는다.",
  },
  {
    pid: 9,
    title: "데이터 수집 범위3",
    content:
      "한 개발자가 사용자의 개인정보를 수집하는 애플리케이션을 개발하는 과정에 참여하고 있다. 그러나 이 개발자는 회사 내부에서 해당 개인정보를 부당하게 사용하는 의도를 알게 된다. 이 상황에서 개발자는 두 가지 선택지가 있다.",
    optionA: "회사와의 조용히 협력한다.",
    optionB:
      "회사의 부정한 행동을 공개 혹은 유저 개인정보 보호를 위해 조치를 취한다.",
  },
  {
    pid: 10,
    title: "개인 정보 보호2",
    content:
      "프로그래머로 일하고 있는 당신은 회사의 데이터베이스에 접근할 수 있는 권한을 가지고 있습니다. 그러던 어느 날, 회사의 경영진 중 한 명이 개인적인 이유로 특정 고객의 개인 정보에 접근하고자 요청합니다. 그러나 이 요청은 회사의 정책에 어긋나며 고객의 개인 정보를유출하는 것입니다. 이 상황에서 당신은 회사의 정책을 준수하고 고객의 개인 정보를 보호해야 하는 윤리적인 의무와, 경영진의 지시에 따라야 하는 직무 간의 충돌에 직면하게 됩니다.",
    optionA: "회사의 정책을 준수하고 고객의 개인 정보를 보호",
    optionB: "경영진의 지시에 따르기",
  },
  {
    pid: 11,
    title: "저작권 윤리의식2",
    content:
      "프로그래머로서 어떤 회사에 취업한 당신은 신규 제품 개발 프로젝트에 참여하게 되었습니다. 프로젝트 팀은 경쟁사의 제품을 분석하여 비슷한 제품을 개발하려는데, 경쟁사의 제품을 획득하기 위해 불법적인 방법을 사용해야 합니다. 회사의 상위 관리자들은 이러한 방법을 사용하여 경쟁사의 제품을 획득하여 개발에 활용하길 원합니다. 당신은 불법적인 방법을 사용하여 경쟁사의 제품을 획득하고 개발에 활용하는 것에 대해 윤리적인 문제를 느낍니다. 이는 개인정보 침해, 불법 행위, 기밀 유출 등과 관련된 문제일 수있습니다. 하지만 상위 관리자들은 이를 지시하고 개발에 활용하길 원하며, 만약 거부한다면프로젝트 참여를 포기하거나 징계 조치를 받을 수 있습니다",
    optionA: "상위 관리자들의 지시에 따르기",
    optionB: "상위 관리자들의 지시에 따르지 않기",
  },
];
